app/controllers/v1/emails_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'email8@gmail.com' LIMIT 1
---
	def new
		raise ActiveRecord::RecordNotFound if !params[:email]
		render json: {
			state: !User.find_by_email(params[:email]).nil?