app/controllers/v1/invisible_areas_controller.rb

	def create
		@invisible_area = InvisibleArea.create!(invisible_area_params)
		current_user.invisible_areas << @invisible_area
		current_user.save!
---
INSERT INTO "invisible_areas" ("latitude", "location", "longitude", "name", "range") VALUES (?, ?, ?, ?, ?)  [["latitude", 10.0], ["location", "Middle of Nowhere"], ["longitude", 10.0], ["name", "Test Invisible Area"], ["range", 50]]
UPDATE "invisible_areas" SET "user_id" = ? WHERE "invisible_areas"."id" = 1  [["user_id", 2]]

	def update
		@invisible_area = InvisibleArea.find(params[:id])
---
SELECT  "invisible_areas".* FROM "invisible_areas"  WHERE "invisible_areas"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		invisible_area = InvisibleArea.find(params[:id])
		invisible_area.destroy!
---
SELECT  "invisible_areas".* FROM "invisible_areas"  WHERE "invisible_areas"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "invisible_areas" WHERE "invisible_areas"."id" = ?  [["id", 1]]