app/controllers/v1/registrations_controller.rb

  def create
    @user = User.new(user_params)
    @user.save!
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?)