app/controllers/v1/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jsksma2@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    email = params[:email]
    password = params[:password]
    if email.nil? || password.nil?
      render status: 400,
      json: {
        error: "An email and password is required."
      } and return
    end

    @user = User.find_by_email(email.downcase)