app/controllers/v1/users_controller.rb

	def social
		current_user.update_social_url!(params[:type], params[:link])
---
UPDATE "users" SET "instagram_url" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["instagram_url", "http://instagram.com"], ["updated_at", "2014-10-12 01:08:06.786510"]]